/*                                        带头节点链式队列                                            */
#ifndef __LINK_QUEUE_H_
#define __LINK_QUEUE_H_
/****************************************************************************************************/
/*                                           INCLUDE                                                */
/****************************************************************************************************/
#include <stdbool.h>
/****************************************************************************************************/
/*                                           DEFINES                                                */
/****************************************************************************************************/
typedef int elemType;
typedef struct _linkNode
{
    elemType data;
    struct _linkNode *next;
} linkNode;
typedef struct _linkQueue
{
    linkNode *front; //头指针指向节点
    linkNode *rear; //尾指针指向节点
    int length; //队列长度
    int maxLen; //队列长度上限
}linkQueue;

/****************************************************************************************************/
/*                                           VARIABLES                                              */
/****************************************************************************************************/

/****************************************************************************************************/
/*                                       STATIC FUNCTIONS                                           */
/****************************************************************************************************/

/****************************************************************************************************/
/*                                       PUBLIC FUNCTIONS                                           */
/****************************************************************************************************/
void initLinkQueue(linkQueue *q, int maxLen);
bool isLinkQueueEmpty(linkQueue *q);
bool enLinkQueue(linkQueue *q, elemType x);
bool deLinkQueue(linkQueue *q, elemType *x);
bool getLinkQueueHead(linkQueue *q, elemType *x);
int getLinkQueueNum(linkQueue *q);

#endif /* __LINK_QUEUE_H_ */